[LANG]
language=Italian (Italia)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Errore di sintassi SQL
200002=File inesistente
200003=File danneggiato
200004=Errore parametro
200026=Nome tabella già esistente
200027=Nome tabella inesistente
200028=Errore importazione file CSV, generazione SQL fallita, controllare il contenuto del file CSV e la configurazione
300001=Nessuna colonna della tabella selezionata per creare l'indice
300002=La dichiarazione SQL non può essere vuota
300003=L'analisi SQL supporta solo query SELECT
[STRING]
home=Home
database=Database
analysis=Analisi
view=Vista
setting=Impostazioni
items=record
tables=Tabelle
views=Viste
triggers=Trigger
columns=Colonne
indexes=Indici
table=Tabella
clear-all=Pulisci tutto
yes=Sì
no=No
welcome-text=Benvenuti su CuteSqlite
home-text1=CuteSqlite è uno strumento client grafico (GUI) per Sqlite3.
home-text2=Consente di progettare, creare e navigare database, gestire oggetti del database,
home-text3=inserire dati, nonché progettare ed eseguire query SQL per elaborare i dati memorizzati.
home-text4=È anche possibile migrare il database e i dati da altri fornitori di database a un database Sqlite.
db-section-text=Database Sqlite
analysis-text1=CuteSqlite consente di analizzare e ottimizzare le prestazioni delle dichiarazioni SQL.
analysis-text2=E consente anche di analizzare la capacità di archiviazione di ogni tabella nel database,
analysis-text3=nonché di configurare i parametri del database per ottimizzarlo.
perf-analysis-section-text=Analisi delle prestazioni
error-text=Errore di sistema:
create-database=Crea un nuovo database (Ctrl+N)
open-database=Apri un database (Ctrl+O)
refresh-database=Aggiorna database (F5)
delete-database=Rimuovi il database selezionato dall'elenco (Canc)
override-user-db=I dati del file eliminato non sono recuperabili. Confermare la sovrascrittura del database?
create-db-success-text=Database creato con successo
open-db-exists-inlist=Il database è già aperto, non ripetere l'operazione
open-db-success-text=Database aperto con successo
delete-user-db=Confermare la rimozione del database "{dbName}" dall'elenco?
delete-db-success-text=Database rimosso dall'elenco con successo
query-editor=Editor query
history=Cronologia
history-tip=Cronologia (F8)
result-list=Risultati
result-info=Informazioni
result-table-data=Dati tabella
table-properties=Proprietà tabella
exec-select-sql=Esegui la query selezionata (F9)
exec-all-sql=Esegui tutte le query (F10)
explain-select-sql=Explain della dichiarazione SQL selezionata (F11)
explain-query-plan-sql=Explain query plan della dichiarazione SQL selezionata (F12)
query-page-help=Funzione di completamento automatico: [Tab] -> scheda successiva; [Ctrl+Spazio] -> elenca corrispondenze; [Ctrl+Invio] -> elenca tutti i tag
no-select-userdb=Nessun database selezionato
no-sql-statement=L'editor query non contiene alcuna dichiarazione SQL
no-sql-content=L'editor query non contiene contenuto SQL
show-form-view=Mostra vista modulo
export-result-as=Esporta come... (Ctrl+Alt+E)
copy-result-data=Copia dati negli appunti
clear-all=Pulisci tutto
ok=OK
cancel=Annulla
export-text-description=Scegli il formato per esportare i dati
csv-settings=Opzioni CSV
csv-field-settings=Colonne
csv-line-settings=Righe
csv-charset-settings=Set di caratteri
excel-settings=Opzioni Excel
sql-settings=Opzioni SQL
export-fields-settings=Seleziona le colonne da esportare
terminated-by=Separatore
enclosed-by=Racchiuso da
escaped-by=Carattere di escape
field-terminated-by=Separatore di colonne
field-enclosed-by=Racchiuso colonne
field-escaped-by=Carattere di escape colonne
line-terminated-by=Separatore di righe
add-column-name=Aggiungi nome colonna nell'intestazione
csv-charset=Set di caratteri
excel-column-max-size=Limite dimensione colonna di testo
excel-decinmal-places=Posizioni decimali
structure-only=Solo struttura
data-only=Solo dati
structure-and-data=Struttura e dati
select-all=Seleziona tutto
deselect-all=Deseleziona tutto
save-to-file=Salva su file
expert-fmt-error=Selezionare il formato file per esportare i dati
terminated-by-error=Inserire il valore per "Separatore"
enclosed-by-error=Inserire il valore per "Racchiuso da"
escaped-by-error=Inserire il valore per "Carattere di escape"
line-terminated-by-error=Il valore del "Separatore di righe" non è corretto
excel-column-max-size-error=Inserire il valore per "Limite dimensione colonna di testo"
excel-decinmal-places-error=Inserire il valore per "Posizioni decimali"
export-sql-error=Selezionare le opzioni SQL
selected-fields-error=Selezionare le colonne da esportare
export-path-error=Inserire il percorso del file di esportazione
sql-notsupport-multitable-query-error=L'esportazione dei risultati di query multi-tabella e sottquery non è supportata
export-success-text=Esportazione riuscita, esportate {rows} righe di dati. Aprire il file?
open-the-file=Apri file
export-file-exists-prompt={export-path} esiste già. Sostituire?
limit-rows=Limite righe
offset=Riga di inizio
rows=Numero di righe
copy-all-rows-to-clipboard=Copia tutte le righe negli appunti Ctrl+Alt+A
copy-sel-rows-to-clipboard=Copia righe selezionate negli appunti Ctrl+Alt+H
copy-all-rows-as-sql=Copia tutte le righe come SQL Ctrl+Alt+J
copy-sel-rows-as-sql=Copia righe selezionate come SQL Ctrl+Alt+K
read-only=Sola lettura
filter=Filtro (Ctrl+Alt+F)
filter-in-use=Filtro in uso
refresh=Aggiorna (Ctrl+F5)
refresh-page=Aggiorna
new-row-tip=Nuova riga (Ctrl+Alt+N)
copy-row-tip=Copia riga (Ctrl+Alt+C)
save-tip=Salva (Ctrl+Alt+S)
delete-tip=Elimina riga selezionata (Ctrl+Canc)
cancel-tip=Annulla modifiche (Ctrl+Alt+Z)
revert-tip=Ripristina
save=Salva
revert=Annulla modifiche
column=Nome colonna
condition=Condizione
value=Valore
delete-confirm-text=Confermare l'eliminazione delle righe selezionate?
query=Query
result=Risultato
affected-rows=Righe interessate
exec-time=Tempo di esecuzione
transfer-time=Tempo di trasferimento
total-time=Tempo totale
database-create=Crea DB Ctrl+N
database-open=Apri DB Ctrl+O
database-refresh=Aggiorna DB Ctrl+R
database-delete=Elimina DB Canc
database-copy=Copia DB come... Ctrl+P
database-export-as-sql=Esporta DB in SQL Ctrl+E
database-import-from-sql=Importa SQL in DB Ctrl+I
database-new=Crea
database-new-table=Tabella
database-new-view=Vista
database-new-trigger=Trigger
export-as-sql-text-description=Esporta tabelle/viste/trigger del DB selezionato come SQL
select-database=Database selezionato
database-objects=Oggetti
structure-and-data-settings=Impostazioni struttura e dati
insert-statement-settings=Impostazioni dichiarazione INSERT
tbl-statement-settings=Impostazioni dichiarazioni tabella
retain-column-text=Mantieni nomi colonna in "Insert Into"
contain-multi-rows-text=Ogni dichiarazione "Insert" contiene più righe (VALUES)
retain-table-text=Mantieni vecchia tabella (Create Table If Not Exists ...)
override-table-text=Sovrascrivi vecchia tabella (DROP TABLE, poi CREATE TABLE)
import-from-sql-text-description=Esecuzione batch delle dichiarazioni nel file SQL.
abort-on-error-text=Ferma in caso di errore.
import-file-not-exists=Il file SQL da importare non esiste, selezionarne un altro.
import-path-empty-error=Il percorso del file di importazione non può essere vuoto.
import=Importa
export=Esporta
tbl-name=Nome tabella
new-table=Crea tabella
new-view=Crea vista
new-trigger=Crea trigger
database=Database
schema=Schema
table-columns=Colonne
table-indexes=Indici
table-foreignkeys=Chiavi esterne
column-name=Nome colonna
data-type=Tipo di dato
default=Predefinito
check=Controllo
index-name=Nome indice
index-type=Tipo indice
index-unique=Unico
partial-clause=Clausola parziale
comments=Commenti
to-be-selected=Colonne disponibili
selected=Selezionate
up=▲
down=▼
no-columns-selected=Nessuna colonna selezionata, selezionarne
sql-preview=Anteprima SQL
tbl-name-empty=Il nome della tabella non può essere vuoto
tbl-name-duplicated=Il nome della tabella esiste già
create-table-success-text=Tabella creata con successo.
alter-table-success-text=Tabella modificata con successo.
rename-table-success-text=Nome tabella modificato con successo.
delete-column-confirm-text=La colonna selezionata è referenziata da uno o più indici. L'eliminazione di questa colonna modificherà anche gli indici corrispondenti. Confermare l'eliminazione?
delete-index-confirm-text=L'indice selezionato è referenziato da una o più colonne. L'eliminazione di questo indice modificherà anche le colonne corrispondenti. Confermare l'eliminazione?
delete-confirm-text=Confermare l'eliminazione?
new-view=Crea vista
new-trigger=Crea trigger
create-a-view-name=Nome nuova vista
view-name-not-empty=Il nome della nuova vista non può essere vuoto
view-name-duplicated=Il nome della vista esiste già
create-a-trigger-name=Nome trigger
trigger-name-not-empty=Il nome del trigger non può essere vuoto
trigger-name-duplicated=Il nome del trigger esiste già
execute-sql-success=SQL eseguito con successo
copy-db-success-text=Database copiato con successo
table-open=Apri dati tabella Alt+O
table-create=Crea tabella Alt+N
table-alter=Modifica tabella Alt+A
table-rename=Rinomina tabella Alt+M
table-truncate=Svuota tabella Alt+T
table-drop=Elimina tabella Alt+Canc
table-copy-as=Copia tabella in... Alt+P
table-sharding-as=Partizionamento Alt+G
table-export=Esporta tabella in... Alt+E
table-import-sql=Importa da file SQL Alt+I
table-import-csv=Importa da file CSV Alt+J
table-manage-index=Gestisci indici tabella
table-manage-foreign-key=Gestisci chiavi esterne tabella
properties=Proprietà
primary-key-duplicated=La chiave primaria è definita più volte.
foreignkey-name=Nome chiave esterna
referencing-columns=Colonne di questa tabella
referenced-table=Tabella referenziata
referenced-columns=Colonne referenziate
on-update=Su aggiornamento
on-delete=Su eliminazione
insert-new-column=Aggiungi nuova colonna
insert-new-index=Aggiungi nuovo indice
insert-new-foreignkey=Aggiungi nuova chiave esterna
insert-del-column=Elimina colonna selezionata
insert-del-index=Elimina indice selezionato
insert-del-foreignkey=Elimina chiave esterna selezionata
select-referenced-table-first=Selezionare prima la tabella referenziata
new-table-name=Nuovo nome tabella
table-name-not-empty=Il nuovo nome tabella non può essere vuoto
table-name-duplicated=Il nuovo nome tabella esiste già
ai-column-exists=Esiste già una colonna AUTOINCREMENT.
ai-fobidden-multi-pk=Esiste già una colonna AUTOINCREMENT, non sono consentite più colonne di chiave primaria.
ai-column-must-integer=La colonna AUTOINCREMENT deve essere di tipo INTEGER.
truncate-table-confirm-text=Dopo lo svuotamento della tabella, i dati non sono recuperabili. Confermare lo svuotamento?
truncate-table-success-text=Dati tabella svuotati con successo
drop-table-confirm-text=Dopo l'eliminazione della tabella, i dati non sono recuperabili. Confermare l'eliminazione?
drop-table-success-text=Tabella eliminata con successo
copy-table-text-description=Configurazione parametri di copia, supporta il partizionamento delle tabelle
from-db-name=Database origine
from-tbl-name=Tabella origine
to-db-name=Database destinazione
to-tbl-name=Tabella destinazione
table-sharding-setttings=Partizionamento tabella
enable-table-sharding=Attiva partizionamento tabella
table-suffix-begin={suffix} Intero iniziale
table-suffix-end={suffix} Intero finale
advanced-settings=Opzioni avanzate partizionamento
enable-copy-data-with-strategy=Attiva strategia per copiare dati nelle tabelle partizionate
sharding-strategy-express-text=Espressione strategia di partizionamento: {n}
preview-sql=Anteprima dichiarazione SQL
structure-and-data-settings-unknown=Impostazioni struttura e dati non selezionate
table-suffix-error=Intero di partizionamento non valido, inserire un valore corretto
target-table-name-no-n=La tabella destinazione deve contenere la stringa "{n}".
sharding-strategy-express-empty=L'espressione della strategia di partizionamento non può essere vuota
copy-table-success-text=Tabella copiata con successo.
start=Avvia
complete=Completato
express-title=Espressione strategia di partizionamento tabella
functions=Funzioni
express-editor-help=Espressione - fare doppio clic su una funzione o campo per inserirlo nell'editor
import-from-csv-text-description=Configurazione per importare dati da un file CSV
source-csv-file=Percorso file CSV origine
target-database=Database destinazione
target-table=Tabella destinazione
columns-setttings=Colonne
csv-data=Dati CSV
column-name-on-top=Prima riga come nomi colonna
line-terminated-by=Separatore di righe
csv-null-as-keyword=null/NULL come parola chiave SQL
encoding=Codifica
import-success-text=Importazione riuscita
incorrect-sql-statement=Dichiarazione SQL errata
import-error-text=Errore di importazione
table-manage-columns=Gestisci colonne
table-drop-column=Elimina colonna
table-manage-indexes=Gestisci indici
table-drop-index=Elimina indice
create-view=Crea nuova vista
open-view=Apri vista
drop-view=Elimina vista
create-trigger=Crea trigger
open-trigger=Apri trigger
drop-trigger=Elimina trigger
drop-view-confirm-text=Dopo l'eliminazione, la vista non è recuperabile. Confermare l'eliminazione?
drop-view-success-text=Vista eliminata con successo
drop-trigger-confirm-text=Dopo l'eliminazione, il trigger non è recuperabile. Confermare l'eliminazione?
drop-trigger-success-text=Trigger eliminato con successo
sql-templates=Modelli dichiarazione SQL
pragma-templates=Pragmas
sql-log=Cronologia SQL
clear-all=Pulisci tutto
use=Usa
explain=Explain
top=Fissa
untop=Sposta
copy=Copia
delete=Elimina
today=Oggi
yestoday=Ieri
delete-sql-log-confirm-text=Confermare l'eliminazione della cronologia SQL?
copy-to-clipboard=Copiato negli appunti
save-success-text=Salvataggio riuscito
delete-success-text=Eliminazione riuscita
data-has-changed=I dati sono stati modificati. Confermare la chiusura della pagina?
not-save-and-close=Non salvare, chiudi
cancel=Annulla chiusura
table-export-as=Esporta tabella Alt+E
export-as-sql-success-text=Esportazione riuscita. Aprire il file?
new-query=Nuova finestra query (F7)
save-current=Salva corrente (Ctrl+S)
save-all=Salva tutto (Ctrl+Maiusc+S)
first-page=Prima pagina
prev-page=Pagina precedente
next-page=Pagina successiva
last-page=Ultima pagina
save-if-data-has-changed=I dati sono stati modificati. Salvare prima di chiudere?
unsort=Annulla ordinamento
tab-close-this=Chiudi questa
tab-close-others=Chiudi le altre
tab-close-left=Chiudi tutte a sinistra
tab-close-right=Chiudi tutte a destra
perf-analysis=Analisi prestazioni
perf-analysis-reports=Report analisi
store-analysis=Analisi archiviazione
db-params=Parametri DB
not-select-sql=Supporta solo dichiarazioni SELECT
open-sql-log=Apri cronologia SQL per analisi prestazioni (Ctrl+L)
add-sql-analysis=Inserire una dichiarazione SQL per analisi prestazioni (Ctrl+I)
sql-log-not-found=Cronologia SQL non trovata, verificare se è stata eliminata
original-sql=Dichiarazione SQL originale
where-clause-analysis=Analisi clausola WHERE
order-clause-analysis=Analisi clausola ORDER
covering-index-analysis=Analisi indici di copertura
table-join-analysis=Analisi JOIN
in-table=Tabella dati
where-use-column=La clausola WHERE utilizza colonne
order-use-column=La clausola ORDER utilizza colonne
covering-index-column=Le clausole WHERE e ORDER utilizzano colonne
where-use-index=La clausola WHERE utilizza un indice
order-use-index=La clausola ORDER utilizza un indice
use-covering-index=Utilizza un indice di copertura
create-index-for-performance=Raccomandazione: creare un indice per le seguenti colonne per migliorare le prestazioni delle query
hint-index-for-performance=Suggerimento: l'indice {hintIndexName} copre già le colonne: {hintIndexColumns}
create-covering-index-for-performance=Raccomandazione: creare un indice di copertura per le seguenti colonne per migliorare le prestazioni delle query
create-index-togeger=Crea indice (insieme)
create-index-individ=Crea indici (separatamente)
create-covering-index=Crea indice di copertura
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=Il pseudocodice seguente mostra il processo di esecuzione dell'ottimizzatore di query
cycle-count=Statistiche cicli
optimize-cycle-count=Suggerimento: modificare l'ordine di join delle tabelle JOIN può ottimizzare e ridurre il numero di cicli.
general-settings=Impostazioni generali
about=Informazioni
language-setting=Impostazione lingua interfaccia
change-language-restart-text=Per cambiare lingua, è necessario riavviare il software.
close-and-restart=Chiudi e riavvia
do-not-restart=Non riavviare
about-us=Chi siamo
about-us-description=CuteSqlite è un software open source sviluppato dall'autore Xuehan Qin.
version-info=Versione
version-info-description=CuteSqlite v0.2.2 beta (64 bit)
feedback=Feedback
feedback-description=Se si hanno problemi con il software, o si hanno idee e suggerimenti per questa applicazione, compilare il modulo sottostante per inviarci un feedback.
content-text=Contenuto
license=Licenza Apache Versione 2.0
select-columns-analysis=Analisi colonne SELECT
select-use-column=La dichiarazione SELECT utilizza le seguenti colonne
select-use-column-count=Numero di colonne
select-use-column-advice=Raccomandazione: la dichiarazione SELECT seleziona più di {maxColumns} colonne. Ridurre il numero di colonne può migliorare le prestazioni delle query.
select-use-column-tips=Suggerimento: ridurre il numero di colonne può migliorare le prestazioni delle query.
sql-perf-report-prefix=rapporto-prestazioni-sql-
store-analysis-prefix=Analisi archiviazione:
analysis-sql=Analisi SQL
open-perf-report=Apri rapporto Alt+O
drop-perf-report=Elimina rapporto Alt+Canc
drop-perf-report-confirm-text=Confermare l'eliminazione del rapporto?
store-analysis-text=Consente di analizzare la capacità di archiviazione del database, delle tabelle e degli indici
table-store-analysis=Tabella - {tblName}
index-store-analysis=Indice - {idxName} - Tabella: {tblName}
db-disk-used-title=Report utilizzo spazio su disco, percorso DB: {dbPath}
page-size-text=Dimensione pagina (byte)
page-size-tips=Dimensione pagina (byte)
file-bytes-text=Dimensione file (byte)
file-bytes-tips=Dimensione file (byte)
file-pgcnt-text=Numero di pagine nell'intero file (misurato)
file-pgcnt-tips=Numero di pagine nell'intero file (misurato)
file-pgcnt2-text=Numero di pagine nell'intero file (calcolato)
file-pgcnt2-tips=Numero di pagine nell'intero file (calcolato)
inuse-pgcnt-text=Numero di pagine che memorizzano dati (usate)
inuse-pgcnt-tips=Numero di pagine che memorizzano dati (usate)
free-pgcnt2-text=Numero di pagine senza dati (per intestazione)
free-pgcnt2-tips=Numero di pagine senza dati (per intestazione)
free-pgcnt-text=Numero di pagine senza dati (calcolato)
free-pgcnt-tips=Numero di pagine senza dati (calcolato)
av-pgcnt-text=Numero di pagine pulite automaticamente
av-pgcnt-tips=Numero di pagine pulite automaticamente
ntable-text=Numero di tabelle nel DB
ntable-tips=Numero di tabelle nel DB
nindex-text=Numero di indici
nindex-tips=Numero di indici
nmanindex-text=Numero di indici definiti
nmanindex-tips=Numero di indici definiti
nautoindex-text=Numero di indici impliciti (auto-incremento)
nautoindex-tips=Numero di indici impliciti (auto-incremento)
user-payload-text=Byte di payload utente memorizzati
user-payload-tips=Byte di payload utente memorizzati
all-tbl-entrycnt-title=Totale dati in tutte le tabelle (numero di record)
all-tbl-idx-pagecnt-title=Numero di pagine di tutte le tabelle e dei loro indici
sperate-tbl-idx-pagecnt-title=Pagine di tutte le tabelle e indici calcolate separatamente
all-tbl-idx-report-title=Tutte le tabelle e indici
total-pages-percent-text=Percentuale del totale pagine DB
total-pages-percent-tips=Percentuale del totale pagine DB
nentry-text=Quantità dati (numero di record)
nentry-tips=Quantità dati (numero di record)
storage-text=Byte di archiviazione utilizzati
storage-tips=Byte di archiviazione utilizzati
compressed-size-text=Byte utilizzati dopo compressione
compressed-size-tips=Byte utilizzati dopo compressione
payload-text=Byte di payload
payload-tips=Byte di payload
total-meta-text=Byte di metadati
total-meta-tips=Byte di metadati
depth-text=Profondità albero B
depth-tips=Profondità albero B
avg-payload-text=Payload medio per record
avg-payload-tips=Payload medio per record
avg-unused-text=Media byte non utilizzati per record
avg-unused-tips=Media byte non utilizzati per record
avg-meta-text=Metadati medi per record
avg-meta-tips=Metadati medi per record
avg-fanout-text=Fattore di ramificazione medio
avg-fanout-tips=Fattore di ramificazione medio
gap-cnt-text=Pagine non contigue
gap-cnt-tips=Pagine non contigue
mx-payload-text=Payload massimo per record
mx-payload-tips=Payload massimo per record
ovfl-cnt-text=Numero di record di overflow utilizzati
ovfl-cnt-tips=Numero di record di overflow utilizzati
int-pages-text=Numero di pagine indice utilizzate
int-pages-tips=Numero di pagine indice utilizzate
leaf-pages-text=Numero di pagine foglia utilizzate
leaf-pages-tips=Numero di pagine foglia utilizzate
ovfl-pages-text=Numero di pagine di overflow utilizzate
ovfl-pages-tips=Numero di pagine di overflow utilizzate
total-pages-text=Numero totale pagine utilizzate
total-pages-tips=Numero totale pagine utilizzate
int-unused-text=Byte non utilizzati su pagine indice
int-unused-tips=Byte non utilizzati su pagine indice
leaf-unused-text=Byte non utilizzati su pagine foglia
leaf-unused-tips=Byte non utilizzati su pagine foglia
ovfl-unused-text=Byte non utilizzati su pagine overflow
ovfl-unused-tips=Byte non utilizzati su pagine overflow
total-unused-text=Byte non utilizzati su tutte le pagine
total-unused-tips=Byte non utilizzati su tutte le pagine
all-table-report-title=Tutte le tabelle (esclusi indici)
all-indices-report-title=Tutti gli indici (escluse tabelle)
tbl-and-all-idx-report-title=Tabella {tblName} e tutti i suoi indici
tbl-only-report-title=Tabella {tblName} (esclusi eventuali indici)
idx-only-report-title=Tutti gli indici della tabella {tblName}
tbl-report-title=Tabella {tblName}
idx-report-title=Indice {idxName} della tabella {tblName}
props-tbl-only-report-title=Analisi archiviazione tabella {tblName}
props-idx-props-only-report-title=Tutti gli indici della tabella {tblName}
db-pragma-params=Parametri PRAGMA
db-quick-config-params=Opzioni di configurazione rapida
select-pragma=PRAGMA
pragma-analysis-limit-tips=Interroga o modifica il limite delle impostazioni di analisi (ANALYZE). È il numero approssimativo di righe che il comando ANALYZE esamina in ogni indice.
pragma-application-id-tips=Utilizzato per interrogare o impostare l'intero con segno a 32 bit "Application ID" in big-endian situato all'offset 68 nell'intestazione del database.
pragma-auto-vacuum-tips=Interroga o imposta lo stato di pulizia automatica (auto-vacuum) nel database.
pragma-automatic-index-tips=Interroga, attiva o disattiva la funzione di indicizzazione automatica.
pragma-busy-timeout-tips=Interroga o modifica l'impostazione del timeout di attesa (busy timeout).
pragma-cache-size-tips=Interroga o modifica il numero massimo di pagine su disco del database che SQLite raccomanda di mantenere in memoria per ogni file di database aperto.
pragma-cache-spill-tips=Attiva o disattiva la capacità del programma di paginazione di scaricare pagine di cache sporche nel file di database durante una transazione.
pragma-case-sensitive-like-tips=Il comportamento predefinito dell'operatore LIKE ignora la differenza tra maiuscole e minuscole per i caratteri ASCII. Pertanto, per impostazione predefinita, 'a' LIKE 'A' è vero.
pragma-cell-size-check-tips=Attiva o disattiva controlli di coerenza aggiuntivi durante la lettura delle pagine dell'albero B del database dal disco. Quando il controllo della dimensione della cella è attivato, il danneggiamento del database può essere rilevato prima e ha meno probabilità di "diffondersi".
pragma-checkpoint-fullfsync-tips=Interroga o modifica il flag fullfsync per le operazioni di checkpoint. Se questo flag è attivato, il metodo di sincronizzazione F_FULLFSYNC verrà utilizzato durante le operazioni di checkpoint sui sistemi che lo supportano. Il valore predefinito del flag CHECKPOINT_FULLFSYNC è OFF. Solo Mac OS-X supporta F_FULLFSYNC.
pragma-collation-list-tips=Restituisce l'elenco delle sequenze di collazione definite per la connessione al database corrente.
pragma-compile-options-tips=Restituisce i nomi delle opzioni di compilazione utilizzate durante la costruzione di SQLite, un'opzione per riga.
pragma-count-changes-tips=Interroga o modifica il flag di conteggio delle modifiche (count changes). Normalmente, quando il flag count-changes non è impostato, le dichiarazioni INSERT, UPDATE e DELETE non restituiscono dati.
pragma-data-store-directory-tips=Interroga o modifica il valore della variabile globale sqlite3_data_directory, utilizzata dal backend dell'interfaccia del sistema operativo Windows per determinare la posizione di archiviazione dei file di database specificati con un percorso relativo.
pragma-data-version-tips=Indica che il file di database è stato modificato. I programmi interattivi che memorizzano il contenuto del database in memoria o lo visualizzano sullo schermo possono utilizzare il comando PRAGMA data_version per determinare se devono aggiornare e ricaricare la memoria o aggiornare la visualizzazione sullo schermo.
pragma-default-cache-size-tips=Interroga o imposta il numero massimo raccomandato di pagine di cache su disco che verranno allocate per ogni file di database aperto.
pragma-defer-foreign-keys-tips=Ordina che tutte le restrizioni di chiave esterna siano differite fino al commit della transazione più esterna.
pragma-empty-result-callbacks-tips=Interroga o modifica il flag di callback di risultato vuoto.
pragma-encoding-tips=Codifica di testo utilizzata dal database principale: 'UTF-8', 'UTF-16le' (UTF-16 little-endian) o 'UTF-16be' (UTF-16 big-endian).
pragma-foreign-key-check-tips=Verifica il database o la tabella per eventuali violazioni delle restrizioni di chiave esterna.
pragma-foreign-keys-tips=Interroga, attiva o disattiva l'applicazione delle restrizioni di chiave esterna.
pragma-freelist-count-tips=Restituisce il numero di pagine inutilizzate nel file di database.
pragma-full-column-names-tips=Interroga o modifica il flag full_column_names.
pragma-fullfsync-tips=Interroga o modifica il flag fullfsync. Questo flag determina se verrà utilizzato il metodo di sincronizzazione F_FULLFSYNC sui sistemi che lo supportano. Il valore predefinito di fullfsync è OFF. Solo Mac OS X supporta F_FULLFSYNC.
pragma-hard-heap-limit-tips=Imposta un limite sulla quantità di memoria heap per tutte le connessioni al database in un singolo processo.
pragma-ignore-check-constraints-tips=Attiva o disattiva l'applicazione delle restrizioni CHECK. L'impostazione predefinita è OFF, il che significa che le restrizioni CHECK vengono applicate per impostazione predefinita.
pragma-incremental-vacuum-tips=Provoca la rimozione di un massimo di N pagine dalla lista delle pagine libere (freelist).
pragma-integrity-check-tips=Esegue un controllo di formattazione e coerenza di basso livello sul database.
pragma-journal-mode-tips=Interroga o imposta la modalità journal (journal mode) per il database associato alla connessione corrente.
pragma-journal-size-limit-tips=Limita la dimensione dei file di journal di rollback (rollback journal) e WAL mantenuti nel filesystem dopo una transazione o un checkpoint.
pragma-legacy-alter-table-tips=Imposta o interroga il valore del flag legacy_alter_table.
pragma-locking-mode-tips=Imposta o interroga la modalità di blocco (locking mode) della connessione al database. Le modalità sono NORMAL o EXCLUSIVE.
pragma-max-page-count-tips=Interroga o imposta il numero massimo di pagine nel file di database.
pragma-mmap-size-tips=Interroga o modifica il numero massimo di byte riservati per I/O con mappatura in memoria (memory-mapped I/O) su un singolo database.
pragma-module-list-tips=Restituisce l'elenco dei moduli di tabella virtuale registrati presso la connessione al database.
pragma-optimize-tips=Tenta di ottimizzare il database.
pragma-page-count-tips=Restituisce il numero totale di pagine nel file di database.
pragma-page-size-tips=Interroga o imposta la dimensione della pagina del database. La dimensione della pagina deve essere una potenza di due compresa tra 512 e 65536.
pragma-parser-trace-tips=Attiva la traccia del parser SQL utilizzato internamente da SQLite. Ha effetto solo se compilato con SQLITE_DEBUG.
pragma-query-only-tips=Impedisce la modifica dei dati nel file di database. Quando attivato, qualsiasi tentativo di CREATE, UPDATE, DROP, INSERT o UPDATE causerà un errore SQLITE_READONLY.
pragma-quick-check-tips=Esegue un controllo di formattazione e coerenza di basso livello sul database, saltando i controlli di coerenza UNIQUE e degli indici.
pragma-read-uncommitted-tips=Interroga, attiva o disattiva il livello di isolamento READ UNCOMMITTED.
pragma-recursive-triggers-tips=Interroga, attiva o disattiva l'esecuzione ricorsiva dei trigger.
pragma-reverse-unordered-selects-tips=Quando attivata, questa pragma fa sì che molte query SELECT senza clausola ORDER BY restituiscano i risultati in un ordine generalmente inverso.
pragma-schema-version-tips=Ottiene o imposta il valore intero schema_version all'offset 40 nell'intestazione del database.
pragma-secure-delete-tips=Interroga o modifica l'impostazione di eliminazione sicura (secure-delete).
pragma-short-column-names-tips=Interroga o modifica il flag di nomi di colonna brevi.
pragma-soft-heap-limit-tips=Limita la quantità di memoria heap utilizzata da tutte le connessioni al database in un singolo processo.
pragma-stats-tips=Restituisce informazioni ausiliarie su tabelle e indici.
pragma-synchronous-tips=Interroga o modifica l'impostazione del flag "synchronous".
pragma-temp-store-tips=Interroga o modifica il valore della variabile globale sqlite3_temp_directory, utilizzata da molti backend dell'interfaccia del sistema operativo per determinare la posizione di archiviazione di tabelle e indici temporanei.
pragma-threads-tips=Numero di thread ausiliari avviati da un'istruzione preparata (prepared statement) per aiutare nella query.
pragma-trusted-schema-tips=Consente o meno l'esecuzione di funzioni SQL e tabelle virtuali non verificate nello schema. Determina se viste, trigger o espressioni di schema (come restrizioni CHECK, clausole DEFAULT, colonne generate, indici di espressione e/o indici parziali) possono eseguire funzioni SQL e tabelle virtuali non verificate.
pragma-user-version-tips=Ottiene o imposta il valore intero user_version all'offset 60 nell'intestazione del database.
pragma-vdbe-addoptrace-tips=I codici operazione VDBE completi vengono visualizzati durante la generazione del codice. Funziona se SQLite è compilato con l'opzione SQLITE_DEBUG e vdbe_debug è attivato.
pragma-vdbe-debug-tips=Attiva il debug VDBE. Funziona se SQLite è compilato con l'opzione SQLITE_DEBUG.
pragma-vdbe-listing-tips=Visualizza l'elenco completo dei codici operazione della macchina virtuale sull'output standard. Funziona se SQLite è compilato con l'opzione SQLITE_DEBUG e vdbe_debug è attivato.
pragma-vdbe-trace-tips=Stampa i codici operazione della macchina virtuale sull'output standard durante il calcolo. Funziona se SQLite è compilato con l'opzione SQLITE_DEBUG e vdbe_debug è attivato.
pragma-wal-autocheckpoint-tips=Interroga o imposta l'intervallo di checkpoint automatico (auto-checkpoint) per il journal write-ahead log.
pragma-wal-checkpoint-tips=Provoca il trasferimento del contenuto del journal write-ahead log per il database X nella connessione D al file di database e il reset del journal.
pragma-writable-schema-tips=Consente di modificare la tabella sqlite_schema utilizzando dichiarazioni UPDATE, INSERT e DELETE ordinarie. Avvertenza: l'abuso di questa pragma può facilmente causare il danneggiamento del file di database.
pragma-save-confirm=La dichiarazione PRAGMA influenzerà il funzionamento del database. Confermare l'esecuzione della seguente dichiarazione?
confirm-exec-text=Conferma ed esegui